Revit 2027 API
ExternalServices.BuiltInExternalServices.RebarUpdateService Property
 Autodesk Internal: The service for updating rebar freeform elements
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId RebarUpdateService { get; }
Public Shared ReadOnly Property RebarUpdateService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ RebarUpdateService {
	ExternalServiceId^ get ();
}
static member RebarUpdateService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace